Repository: BravoBaldo/Translations
Catalog: Node-RED/OmegaT_NodeRed/OmegaT_NodeRed-level2.tmx
Source language: en_us
Languages: it_it

source: `context.keys(..)` : return a list of all node-scoped context property keys
it_it: `context.keys(..)` : restituisce un elenco di tutte le "property key" di contesto nello scope del nodo

source: `context.set(..)` : set a node-scoped context property
it_it: `context.set(..)` : imposta una proprietà di contesto nello scope del nodo

source: `context` - the node's local context
it_it: `context` - il contesto locale del nodo

source: `disable` - Disable the specified module or node set
it_it: `disable` - Disabilita il modulo o il set di nodi specificato

source: `enable` - Enable the specified module or node set
it_it: `enable` - Abilita il modulo o il set di nodi specificato

source: `env.get(..)` : get an environment variable
it_it: `env.get(..)` : ottiene una variabile di ambiente

source: `flow.get(..)` : get a flow-scoped context property
it_it: `flow.get(..)` : ottiene una proprietà di contesto nello scope del flusso

source: `flow.keys(..)` : return a list of all flow-scoped context property keys
it_it: `flow.keys(..)` : restituisce un elenco di tutte le "property key" di contesto nello scope del flusso

source: `flow.set(..)` : set a flow-scoped context property
it_it: `flow.set(..)` : imposta una proprietà di contesto nello scope del flusso

source: `flow` - the flow scope context
it_it: `flow` - il contesto dello scope del flusso

source: `global.get(..)` : get a global-scoped context property
it_it: `global.get(..)` : ottiene una proprietà di contesto nello scope globale

source: `global.keys(..)` : return a list of all global-scoped context property keys
it_it: `global.keys(..)` : restituisce un elenco di tutte le "property key" di contesto nello scope globale

source: `global.set(..)` : set a global-scoped context property
it_it: `global.set(..)` : imposta una proprietà di contesto nello scope globale

source: `global` - the global scope context
it_it: `global` - il contesto dello scope globale

source: `hash-pw` - Create a password hash that can be used with the `adminAuth` and `httpNodeAuth` settings
it_it: `hash-pw` - Crea un hash della password utilizzabile con le impostazioni `adminAuth` e `httpNodeAuth`

source: `icon` can be any FontAwesome icon name.
it_it: `icon` può essere qualsiasi nome di icona FontAwesome.

source: `info` - Display more information about the module or node
it_it: `info` - Visualizza maggiori informazioni sul modulo o sul nodo

source: `install` - Install the module from NPM to Node-RED
it_it: `install` - Installa il modulo da NPM a Node-RED

source: `key` - Private key in PEM format, provided as a `String` or `Buffer`
it_it: `key` - Chiave privata in formato PEM, fornita come `String` o `Buffer`

source: `label`/`icon` - used on the login page.
it_it: `label`/`icon` - utilizzato nella pagina di login.

source: `list` - List all of the installed nodes
it_it: `list` - Elenca tutti i nodi installati

source: `login` - Log user in to the target of the Node-RED admin API
it_it: `login` - Effettua il login dell'utente nella destinazione dell'API di admin di Node-RED

source: `msg4` will be sent to the second output.
it_it: `msg4` verrà inviato al secondo output.

source: `name` - the name of the passport strategy being used
it_it: `name` - il nome della strategia passport utilizzata

source: `node.debug(..)` : [log a debug message](#logging-events)
it_it: `node.debug(..)` : [log di un messaggio di debug](#logging-events)

source: `node.done(..)` : [finish with a message](#finishing-with-a-message)
it_it: `node.done(..)` : [termina con un messaggio](#finishing-with-a-message)

source: `node.error(..)` : [log an error message](#logging-events)
it_it: `node.error(..)` : [log di un messaggio di errore](#logging-events)

source: `node.id` : the id of the Function node - *added in 0.19*
it_it: `node.id` : l'ID del nodo Funzione - *aggiunto nella versione 0.19*

source: `node.log(..)` : [log a message](#logging-events)
it_it: `node.log(..)` : [log di un messaggio](#logging-events)

source: `node.name` : the name of the Function node - *added in 0.19*
it_it: `node.name` : il nome del nodo Funzione - *aggiunto nella versione 0.19*

source: `node.on(..)` : [register an event handler](#sending-messages-asynchronously)
it_it: `node.on(..)` : [registra un "event handler"](#sending-messages-asynchronously)

source: `node.outputCount` : number of outputs set for Function node - *added in 1.3*
it_it: `node.outputCount` : numero di output impostati per il nodo Funzione - *aggiunto nella versione 1.3*

source: `node.outputCount` contains the number of outputs configured for the function node.
it_it: `node.outputCount` contiene il numero di output configurati per il nodo funzione.

source: `node.send(..)` : [send a message](#sending-messages-asynchronously)
it_it: `node.send(..)` : [invia un messaggio](#sending-messages-asynchronously)

source: `node.status(..)` : [update the node status](#adding-status)
it_it: `node.status(..)` : [aggiorna lo stato del nodo](#adding-status)

source: `node.trace(..)` : [log a trace message](#logging-events)
it_it: `node.trace(..)` : [di un messaggio di trace](#logging-events)

source: `node.warn(..)` : [log a warning message](#logging-events)
it_it: `node.warn(..)` : [log di un messaggio warning](#logging-events)

source: `options` - an options object passed to the passport strategy when it is created.
it_it: `options` - un oggetto opzioni passato alla strategia passport al momento della sua creazione.

source: `read` - read-only access
it_it: `read` - accesso di sola lettura

source: `remove` - Remove the NPM module from Node-RED
it_it: `remove` - Rimuove il modulo NPM da Node-RED

source: `search` - Search for Node-RED modules to install
it_it: `search` - Cerca i moduli Node-RED da installare

source: `setInterval/clearInterval` - the javascript interval functions.
it_it: `setInterval/clearInterval` - le funzioni di intervallo di Javascript.

source: `setTimeout/clearTimeout` - the javascript timeout functions.
it_it: `setTimeout/clearTimeout` - le funzioni di timeout di Javascript.

source: `strategy` - the passport strategy module
it_it: `strategy` - il modulo della strategia passport

source: `target` - Set or view the target URL and port like http://localhost:1880
it_it: `target` - Imposta o visualizza l'URL e la porta di destinazione, ad esempio http://localhost:1880

source: `util` - the Node.js `util` module
it_it: `util` - il modulo `util` di Node.js

source: `verify` - the verify function used by the strategy.
it_it: `verify` - la funzione di verifica utilizzata dalla strategia.

source: at which point, the module can be referenced within a function as `global.get('osModule')`.
it_it: a questo punto, il modulo può essere referenziato all'interno di una funzione come `global.get('osModule')`.

source: authentication against any OAuth/OpenID provider such as Twitter or GitHub
it_it: autenticazione tramite qualsiasi provider OAuth/OpenID come Twitter o GitHub

source: placeholder
it_it: segnaposto

source: username/password credential based authentication
it_it: autenticazione basata su credenziali nome utente/password

source: {% highlight javascript %} // Create an array same length as there are outputs const messages = new Array(node.outputCount) // Choose random output number to send the message to const chosenOutputIndex = Math.floor(Math.random() * node.outputCount); // Send the message only to chosen output messages[chosenOutputIndex] = msg; // Return the array containing chosen output return messages; {% endhighlight %}
it_it: `// Create an array same length as there are outputs `<br>`const messages = new Array(node.outputCount)`<br>`// Choose random output number to send the message to `<br>`const chosenOutputIndex = Math.floor(Math.random() * node.outputCount); `<br>`// Send the message only to chosen output `<br>`messages[chosenOutputIndex] = msg; `<br>`// Return the array containing chosen output `<br>`return messages; `<br>

source: {% highlight javascript %} // Get single value flow.get("count", function(err, myCount) { ... });
it_it: `// Get single value`<br>`flow.get("count", function(err, myCount) { ... });`

source: {% highlight javascript %} // Get value - sync var myCount = flow.get("count", storeName);
it_it: `// Get value - sync `<br>`var myCount = flow.get("count", storeName);`

source: {% highlight javascript %} // Node-RED 0.19 or later flow.set(["count", "colour", "temperature"], [123, "red", "12.5"]); {% endhighlight %}
it_it: `// Node-RED 0.19 or later`<br>`flow.set(["count", "colour", "temperature"], [123, "red", "12.5"]);`

source: {% highlight javascript %} // Node-RED 0.19 or later var values = flow.get(["count", "colour", "temperature"]); // values[0] is the 'count' value // values[1] is the 'colour' value // values[2] is the 'temperature' value {% endhighlight %}
it_it: `// Node-RED 0.19 or later`<br>`var values = flow.get(["count", "colour", "temperature"]);`<br>`// values[0] is the 'count' value`<br>`// values[1] is the 'colour' value`<br>`// values[2] is the 'temperature' value`

source: {% highlight javascript %} // initialise the counter to 0 if it doesn't exist already var count = context.get('count')||0; count += 1; // store the value back context.set('count',count); // make it part of the outgoing msg object msg.count = count; return msg; {% endhighlight %}
it_it: `// initialise the counter to 0 if it doesn't exist already`<br>`var count = context.get('count')||0;`<br>`count += 1;`<br>`// store the value back`<br>`context.set('count',count);`<br>`// make it part of the outgoing msg object`<br>`msg.count = count;`<br>`return msg;`

source: {% highlight javascript %} context.get('count', function(err, count) { if (err) { node.error(err, msg); } else { // initialise the counter to 0 if it doesn't exist already count = count || 0; count += 1; // store the value back context.set('count',count, function(err) { if (err) { node.error(err, msg); } else { // make it part of the outgoing msg object msg.count = count; // send the message node.send(msg); } }); } }); {% endhighlight %}
it_it: `context.get('count', function(err, count) {`<br>` if (err) {`<br>` node.error(err, msg);`<br>` } else {`<br>` // initialise the counter to 0 if it doesn't exist already`<br>` count = count || 0;`<br>` count += 1;`<br>` // store the value back`<br>` context.set('count',count, function(err) {`<br>` if (err) {`<br>` node.error(err, msg);`<br>` } else {`<br>` // make it part of the outgoing msg object`<br>` msg.count = count;`<br>` // send the message`<br>` node.send(msg);`<br>` }`<br>` });`<br>` }`<br>`});`

source: {% highlight javascript %} doSomeAsyncWork(msg, function(result) { msg.payload = result; node.send(msg); node.done(); }); return; {% endhighlight %}
it_it: `doSomeAsyncWork(msg, function(result) {`<br>` msg.payload = result;`<br>` node.send(msg);`<br>` node.done();`<br>`});`<br>`return;`

source: {% highlight javascript %} doSomeAsyncWork(msg, function(result) { msg.payload = result; node.send(msg); }); return; {% endhighlight %}
it_it: `doSomeAsyncWork(msg, function(result) {`<br>` msg.payload = result;`<br>` node.send(msg);`<br>`});`<br>`return;`

source: {% highlight javascript %} flow.set("count", 123); {% endhighlight %}
it_it: `flow.set("count", 123);`

source: {% highlight javascript %} functionGlobalContext: { osModule:require('os') } {% endhighlight %}
it_it: `functionGlobalContext: {`<br>` osModule:require('os')`<br>`}`

source: {% highlight javascript %} if (msg.topic === "banana") { return [ null, msg ]; } else { return [ msg, null ]; } {% endhighlight %}
it_it: `if (msg.topic === "banana") {`<br>` return [ null, msg ]; `<br>`} else {`<br>` return [ msg, null ]; `<br>`} `

source: {% highlight javascript %} node.error("hit an error", msg); {% endhighlight %}
it_it: `node.error("hit an error", msg);`

source: {% highlight javascript %} node.log("Something happened"); node.warn("Something happened you should know about"); node.error("Oh no, something bad happened"); {% endhighlight %}
it_it: `node.log("Something happened");`<br>`node.warn("Something happened you should know about");`<br>`node.error("Oh no, something bad happened");`

source: {% highlight javascript %} node.on('close', function() { // tidy up any async code here - shutdown connections and so on.
it_it: `node.on('close', function() {`<br>` // tidy up any async code here - shutdown connections and so on.`<br>`

source: {% highlight javascript %} node.send(msg,false); {% endhighlight %}
it_it: `node.send(msg,false);`

source: {% highlight javascript %} node.status({fill:"red",shape:"ring",text:"disconnected"}); node.status({fill:"green",shape:"dot",text:"connected"}); node.status({text:"Just text status"}); node.status({}); // to clear the status {% endhighlight %}
it_it: `node.status({fill:"red",shape:"ring",text:"disconnected"});`<br>`node.status({fill:"green",shape:"dot",text:"connected"});`<br>`node.status({text:"Just text status"});`<br>`node.status({}); // to clear the status`

source: {% highlight javascript %} node.warn("my var xyz = " + xyz); {% endhighlight %}
it_it: ` node.warn("my var xyz = " + xyz); `

source: {% highlight javascript %} return msg; {% endhighlight %}
it_it: `return msg;`

source: {% highlight javascript %} var msg1 = { payload:"first out of output 1" }; var msg2 = { payload:"second out of output 1" }; var msg3 = { payload:"third out of output 1" }; var msg4 = { payload:"only message from output 2" }; return [ [ msg1, msg2, msg3 ], msg4 ]; {% endhighlight %}
it_it: `var msg1 = { payload:"first out of output 1" };`<br>`var msg2 = { payload:"second out of output 1" };`<br>`var msg3 = { payload:"third out of output 1" };`<br>`var msg4 = { payload:"only message from output 2" };`<br>`return [ [ msg1, msg2, msg3 ], msg4 ];`

source: {% highlight javascript %} var myCount = flow.get("count"); {% endhighlight %}
it_it: `var myCount = flow.get("count");`

source: {% highlight javascript %} var newMsg = { payload: msg.payload.length }; return [msg, newMsg]; {% endhighlight %}
it_it: `var newMsg = { payload: msg.payload.length };`<br>`return [msg, newMsg];`

source: {% highlight javascript %} var newMsg = { payload: msg.payload.length }; return newMsg; {% endhighlight %}
it_it: ` var newMsg = { payload: msg.payload.length };`<br>`return newMsg; `

source: {% highlight javascript %} var outputMsgs = []; var words = msg.payload.split(" "); for (var w in words) { outputMsgs.push({payload:words[w]}); } return [ outputMsgs ]; {% endhighlight %}
it_it: `var outputMsgs = [];`<br>`var words = msg.payload.split(" ");`<br>`for (var w in words) {`<br>` outputMsgs.push({payload:words[w]});`<br>`}`<br>`return [ outputMsgs ];`
